Revit 2027 API
CableTraySizes.GetCableTraySizes Method
 Gets the cable tray sizes of the project.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static CableTraySizes GetCableTraySizes(
	Document aDoc
)
Public Shared Function GetCableTraySizes (
	aDoc As Document
) As CableTraySizes
public:
static CableTraySizes^ GetCableTraySizes(
	Document^ aDoc
)
static member GetCableTraySizes :
        aDoc : Document -> CableTraySizes
Parameters
aDoc Document
 The document.
Return Value
CableTraySizes
 The cable tray sizes of the project.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
CableTraySizes Class
Autodesk.Revit.DB.Electrical Namespace